CSI API ETABS v1

# cPointObjSetSpringCoupled Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetSpringCoupled(
    	string Name,
    	ref double[] K,
    	eItemType ItemType = eItemType.Objects,
    	bool IsLocalCSys = false,
    	bool Replace = false
    )

    Function SetSpringCoupled (
    	Name As String,
    	ByRef K As Double(),
    	Optional ItemType As eItemType = eItemType.Objects,
    	Optional IsLocalCSys As Boolean = false,
    	Optional Replace As Boolean = false
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim K As Double()
    Dim ItemType As eItemType
    Dim IsLocalCSys As Boolean
    Dim Replace As Boolean
    Dim returnValue As Integer

    returnValue = instance.SetSpringCoupled(Name,
    	K, ItemType, IsLocalCSys, Replace)

    int SetSpringCoupled(
    	String^ Name,
    	array<double>^% K,
    	eItemType ItemType = eItemType::Objects,
    	bool IsLocalCSys = false,
    	bool Replace = false
    )

    abstract SetSpringCoupled :
            Name : string *
            K : float[] byref *
            ?ItemType : eItemType *
            ?IsLocalCSys : bool *
            ?Replace : bool
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
            let _IsLocalCSys = defaultArg IsLocalCSys false
            let _Replace = defaultArg Replace false
    *)
    -> int

#### Parameters

Name

    Type: SystemString

K

    Type: SystemDouble

ItemType (Optional)

    Type: ETABSv1eItemType

IsLocalCSys (Optional)

    Type: SystemBoolean

Replace (Optional)

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com